In [1]:
import pandas as pd

In [28]:
df=pd.read_csv('E:\\csv files\\student.csv')
df.fillna(method='ffill',inplace=True)
df

          date  studen id  class section  study hrs  percentage
0   01-04-2021     1001.0     10       a        2.0        50.0
1   02-04-2021     1002.0     10       a        2.0        80.0
2   03-04-2021     1003.0     10       a        3.0        60.0
3   04-04-2021     1004.0     10       a        0.0        60.0
4   05-04-2021     1004.0     11       a        4.0        60.0
5   06-04-2021     1006.0     11       d       10.0        60.0
6   07-04-2021     1007.0     11       b        4.0        80.0
7   08-04-2021     1007.0     11       s        4.0        80.0
8   09-04-2021     1007.0     12       a        4.0        90.0
9   10-04-2021     1010.0     12       c        5.0        90.0
10  11-04-2021     1011.0     12       a        5.0        90.0
11  12-04-2021     1012.0     12       b        6.0        85.0

In [30]:
gr1=df.groupby(by='section')

In [31]:
gr1.groups

{'a': [0, 1, 2, 3, 4, 8, 10], 'b': [6, 11], 'c': [9], 'd': [5], 's': [7]}

In [32]:
gr1=df.groupby(['section','class']).groups
gr1

{('a', 10): [0, 1, 2, 3], ('a', 11): [4], ('a', 12): [8, 10], ('b', 11): [6], ('b', 12): [11], ('c', 12): [9], ('d', 11): [5], ('s', 11): [7]}

In [33]:
for section, df1 in gr1:
    print(section)
    print(df1)

a
10
a
11
a
12
b
11
b
12
c
12
d
11
s
11

In [34]:
list(gr1)

[('a', 10),
 ('a', 11),
 ('a', 12),
 ('b', 11),
 ('b', 12),
 ('c', 12),
 ('d', 11),
 ('s', 11)]

In [35]:
dict(list(gr1))

{'a': 12, 'b': 12, 'c': 12, 'd': 11, 's': 11}

In [36]:
gr2=df.groupby('section').get_group('a')
gr2

          date  studen id  class section  study hrs  percentage
0   01-04-2021     1001.0     10       a        2.0        50.0
1   02-04-2021     1002.0     10       a        2.0        80.0
2   03-04-2021     1003.0     10       a        3.0        60.0
3   04-04-2021     1004.0     10       a        0.0        60.0
4   05-04-2021     1004.0     11       a        4.0        60.0
8   09-04-2021     1007.0     12       a        4.0        90.0
10  11-04-2021     1011.0     12       a        5.0        90.0

In [39]:
gr2.sum()

date          01-04-202102-04-202103-04-202104-04-202105-04-...
studen id                                                7032.0
class                                                        75
section                                                 aaaaaaa
study hrs                                                  20.0
percentage                                                490.0
dtype: object

In [40]:
gr2.mean()

studen id     1004.571429
class           10.714286
study hrs        2.857143
percentage      70.000000
dtype: float64

In [41]:
gr2.describe()

         studen id      class  study hrs  percentage
count     7.000000   7.000000   7.000000    7.000000
mean   1004.571429  10.714286   2.857143   70.000000
std       3.408672   0.951190   1.676163   16.329932
min    1001.000000  10.000000   0.000000   50.000000
25%    1002.500000  10.000000   2.000000   60.000000
50%    1004.000000  10.000000   3.000000   60.000000
75%    1005.500000  11.500000   4.000000   85.000000
max    1011.000000  12.000000   5.000000   90.000000

In [42]:
gr2.agg(['sum','max','mean'])

,date,studen id,class,section,study hrs,percentage
sum,01-04-202102-04-202103-04-202104-04-202105-04-...,7032.000000,75.000000,aaaaaaa,20.000000,490.0
max,11-04-2021,1011.000000,12.000000,a,5.000000,90.0
mean,NaN,1004.571429,10.714286,NaN,2.857143,70.0